WickedDevice/WildFire-Arduino-Core/WickedDevice/avr/boards.txt
wildfirev2.name=WildFire v2

wildfirev2.upload.protocol=wiring
wildfirev2.upload.maximum_size=122878
wildfirev2.upload.speed=38400
wildfirev2.upload.tool=avrdude

wildfirev2.bootloader.low_fuses=0xd7
wildfirev2.bootloader.high_fuses=0xd8
wildfirev2.bootloader.extended_fuses=0xfc
wildfirev2.bootloader.path=stk500v2
wildfirev2.bootloader.file=stk500boot_v2_wildfire.hex
wildfirev2.bootloader.unlock_bits=0x3F
wildfirev2.bootloader.lock_bits=0x0F

wildfirev2.build.mcu=atmega1284p
wildfirev2.build.f_cpu=16000000L
wildfirev2.build.board=WILDFIRE_V2
wildfirev2.build.core=arduino:arduino
wildfirev2.build.variant=wildfirev2




wildfirev3.name=WildFire v3

wildfirev3.upload.protocol=wiring
wildfirev3.upload.maximum_size=122878
wildfirev3.upload.speed=38400
wildfirev3.upload.tool=avrdude

wildfirev3.bootloader.low_fuses=0xd7
wildfirev3.bootloader.high_fuses=0xd8
wildfirev3.bootloader.extended_fuses=0xfc
wildfirev3.bootloader.path=stk500v2
wildfirev3.bootloader.file=stk500boot_v3_wildfire.hex
wildfirev3.bootloader.unlock_bits=0x3F
wildfirev3.bootloader.lock_bits=0x0F

wildfirev3.build.mcu=atmega1284p
wildfirev3.build.f_cpu=16000000L
wildfirev3.build.board=WILDFIRE_V3
wildfirev3.build.core=arduino:arduino
wildfirev3.build.variant=wildfirev3
